openfoam2206/tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/constant/air/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        3;      // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      6;      // polar angles in PI (from Z to X-Y plane)
    maxIter     25;     // maximum number of iterations
    tolerance   2e-2;   // convergence criteria for radiation iteration

    useSolarLoad      false;

    useExternalBeam   true;

    // Energy spectrum for the external beam
    spectralDistribution (2 1);
}

solarCalculatorCoeffs
{
    sunDirectionModel    tracking;

        sunTrackingUpdateInterval 800; // Time interval to update Sun position
        localStandardMeridian     9;       // GMT offset (hours)
        startDay                  204;     // day of the year
        startTime                 15;      // time of the day (hours decimal)
        longitude                 139.74;  // longitude (degrees)
        latitude                  35.658;  // latitude (degrees)
        gridUp                    (0 0 1); // Grid orientation
        gridEast                  (1 0 0);


    sunLoadModel    fairWeather;

        // Fair weather conditions model constants
        // Calculate beta from the Solar calculator or input
        groundReflectivity 0.2;
        A       500;   // Apparent solar irradiation at air mass m = 0
        B       0.142; // Atmospheric extinction coefficient
        C       0.058; // Solar diffusivity constant
        //beta    45;  // Solar altitude (in degrees) above the horizontal


    // see solarCalculator.H for other model examples and details
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel multiBandZoneAbsorptionEmission;

multiBandZoneAbsorptionEmissionCoeffs
{
    absorptivity  (0.01 0.01);
    emissivity    (0.01 0.01);

    zones
    {
        absorptivity  ("trees" (20 20));
        emissivity    ("trees" (20 20));
    }
}

scatterModel    none;

sootModel       none;


// ************************************************************************* //
